app/Controllers/Api.php

SELECT `penjualan`.`id` as `id_penjualan`, `barang`.`nama_barang`, `penjualan`.`id_barang`, `penjualan`.`stok`, `penjualan`.`terjual`, `penjualan`.`tgl_transaksi`, DATE_FORMAT(penjualan.tgl_transaksi, "%d %b %Y") as tgl_disp, `jenis_barang`.`jenis_barang`
FROM `penjualan`
JOIN `barang` ON `barang`.`id` = `penjualan`.`id_barang`
JOIN `jenis_barang` ON `jenis_barang`.`id` = `barang`.`id_jenis_barang`
WHERE `penjualan`.`deleted_at` IS NULL
AND `penjualan`.`id` = '10'
---
    public function ReadPenjualan($id = 0) {

        $PenjualanModel = new \App\Models\PenjualanModel();
        $PenjualanModel->select('penjualan.id as id_penjualan, barang.nama_barang, penjualan.id_barang, penjualan.stok, penjualan.terjual, penjualan.tgl_transaksi, DATE_FORMAT(penjualan.tgl_transaksi, "%d %b %Y") as tgl_disp, jenis_barang.jenis_barang');
        $PenjualanModel->join('barang', 'barang.id = penjualan.id_barang');
        $PenjualanModel->join('jenis_barang', 'jenis_barang.id = barang.id_jenis_barang');

        if ($id != 0) {
            return $this->SendJSON($PenjualanModel->find($id));

UPDATE `barang` SET `deleted_at` = '2022-06-27 01:21:29'
WHERE `id` IN ('6')
AND `deleted_at` IS NULL
UPDATE `penjualan` SET `deleted_at` = '2022-06-27 01:21:29'
WHERE `id_barang` = '6'
AND `deleted_at` IS NULL
---
    public function DeleteBarang($id) {
        $BarangModel = new \App\Models\BarangModel();
        $PenjualanModel = new \App\Models\PenjualanModel();

        $PenjualanModel->where('id_barang', $id);
        if($PenjualanModel->delete() != true){