app/Controllers/Home.php

SELECT `id`, `nama_barang`
FROM `barang`
WHERE `barang`.`deleted_at` IS NULL
---
    public function index()
    {
        $BarangModel = new \App\Models\BarangModel();
        $BarangModel->select('id, nama_barang');

        $data['barang'] = $BarangModel->findAll();

SELECT `id`, `jenis_barang`
FROM `jenis_barang`
WHERE `jenis_barang`.`deleted_at` IS NULL
---
    public function barang(){
        $JBarangModel = new \App\Models\JenisBarangModel();
        $JBarangModel->select('id, jenis_barang');

        $data['jbarang'] = $JBarangModel->findAll();